#include "mq2.h"
#include "adc.h"
#include "oled.h "
#include "stdio.h"
#include "glob.h"

/**********************************************************************
* 函数名称：MQ2_Init
* 功能描述：烟雾传感器模块
* 输入参数：无
* 返回值：无
* 补充说明：无
**********************************************************************/
void MQ2_Init()
{
	Adc_Init();
}
/**********************************************************************
* 函数名称：MQ2_Handle
* 功能描述：MQ2的ad值转换成浓度值
* 输入参数：无
* 返回值：无
* 补充说明：MQ2的探测范围在100~10000ppm
*			STM32的12位ad(分辨率是1/4096,范围0~4096)
*			从中可以求出他们的比例关系     (10000-100)/(4096-0) = 2.4
*			得到比例关系之后，就可以求出 烟雾浓度(ppm)=AD值*比例
**********************************************************************/
void MQ2_Handle()
{
	pMQ2->MQ2_Value = Get_Adc_Average(MQ2_ADC_CHANNEL,5) * 2.4;
	OLED_ShowNum(52, 6, pMQ2->MQ2_Value, 5, 16);
	MQ2_LIMIT(gState);		
	pMQ2->MQ2_High = (u8)(pMQ2->MQ2_Value >> 8);
	pMQ2->MQ2_Low = (u8)pMQ2->MQ2_Value & 0xff;
}
/**********************************************************************
* 函数名称：MQ2_LIMIT
* 功能描述：对MQ2浓度进行比较，若超限则报警
* 输入参数：data(当前模式)
* 返回值：无
* 补充说明：无
**********************************************************************/
void MQ2_LIMIT(Byte8 data)
{
	if(data.bits.b2)
	{
		if(pMQ2->MQ2_Value > MQ2PPM_LIMIT)
		{
			gState.ALL |= 0x81;
		}
		else
		{
			gState.ALL &= ~0x81;
		}
//		OLED_SHOWBMP(gState);
	}
}
